// ---------------------------------------------------
//                     Login
// ---------------------------------------------------
/**
 * Тип действия, используется при запросе на вход/авторизацию
 */
export const LOGIN_REQUEST = "LOGIN_REQUEST";
/**
 * Тип действия, используется при успешном входе/авторизации
 */
export const LOGIN_SUCCESS = "LOGIN_SUCCESS";
/**
 * Тип действия, используется при неудачном входе/авторизации
 */
export const LOGIN_FAILED = "LOGIN_FAILED";
// ---------------------------------------------------
// ---------------------------------------------------

// ---------------------------------------------------
//                     Logout
// ---------------------------------------------------
/**
 * Тип действия, используется при выходе пользователя из системы (logout)
 */
export const ACTION_LOGOUT = "ACTION_LOGOUT";
// ---------------------------------------------------
